{
	"homeData": {
		"career": {
            "title": "UX Developer",
            "media": "headshot",
            "content": [
                {
                    "text": "Over 6 years of experience as UI/UX and Frontend Web Developer specializing in the development and design of user interfaces for complex software applications."
                },
                {
                    "text": "Expert at developing full stack enterprise level web and Android applications utilizing Angular, React, Ionic, Vue, PostgreSQL, NodeJS, JavaScript, TypeScript, HTML5, and CSS3."
                },
                {
                    "text": "Experience in Web and Client/Server applications that includes analysis, design, coding, testing, and implementation of the systems accompanied by strong programming skills in JavaScript."
                },
                {
                    "text": "Cross trained in UX design, knowledgeable on user stories, workflows, and user centric design. Experience developing prototypes and wireframes via MockFlow and mockups in Axure and Photoshop."
                }
            ],
			"links": [
                {
					"url": "https://www.linkedin.com/in/adairdaniels/",
					"text": "LinkedIn"
				},
				{
					"url": "https://github.com/andeleidun",
					"text": "GitHub"
				}
            ],
            "classes": "home-card bio-card"
		},
		"highlights": {
            "title": "Highlights",
            "media": "",
            "content": [
                {
                    "linkset": {
                        "url": "https://play.google.com/store/apps/details?id=com.ketomatecalculator.app",
                        "title": "Keto Mate",
                        "img": "ketomate",
                        "text": "Keto Mate is a highly successful diet tool for the Ketogenic diet, with over 20,000 users and a 4* rating."
                    }
                },
                {
                    "linkset": {
                        "url": "https://www.hp.com/",
                        "title": "HP",
                        "img": "hp",
                        "text": "Former Sr. Frontend Developer at HP"
                    }
                }
            ],
            "links": "",
            "classes": "home-card highlights-card"
		},
		"experience": {
            "title": "Experience",
            "media": "",
            "content": [
                {
                    "title": "Adair Futures"
                },
                {
                    "text": "Develop and launch the Keto Mate suite of apps full stack utilizing Angular, Ionic, and NodeJS, and grow its user base – currently over 20k users with a 4* rating on Google Play."
                },
                {
                    "text": "Consult on frontend framework technologies for web apps, guiding on design direction, adherence to UX and accessibility standards, and establishing unit testing using Angular, React, Vue, Jest, Mocha, Chai, and JavaScript/TypeScript."
                },
                {
                    "text": "Guide clients on and assist with deployment of cloud based infrastructure using AWS, setting up templates for and launching EC2 instances and S3 allocations, as well as managing and securing with AWS Management Console."
                },
                {
                    "text": "Collaborate with client UX designers on wireframes and mockups using Axure, advising on design documents and guiding towards UX best practices and mindfulness of accessibility standards."
                },
                {
                    "text": "Create and manage fluid eCommerce sites and web presences for clients using WordPress, WooCommerce, Genesis Framework, HTML5, CSS3, PHP, and JavaScript."
                },
                {
                    "text": "Research and report on the future development of industries and technologies, and present findings in Qualitative Futures Squares form."
                }
            ],
            "links": "",
            "classes": "home-card experience-card"
		}
	}
}